In [1]:
import numpy as np
import pandas as pd

In [109]:
np.random.seed(8)
data = {'January':np.random.randint(24,39,30),
        'February':np.random.randint(24,39,30),
       'March':np.random.randint(24,39,30)}

In [110]:
temp = pd.DataFrame(data)

In [111]:
temp.tail()

    January  February  March
25       38        36     33
26       30        36     26
27       37        34     31
28       32        24     38
29       33        31     33

In [112]:
# temp.iloc[30] = np.random.randint(24,39,3)

In [113]:
# temp.iloc[30]

In [114]:
temp.index

RangeIndex(start=0, stop=30, step=1)

In [115]:
temp.drop(28,inplace=True)

In [116]:
temp.tail()

    January  February  March
24       26        32     24
25       38        36     33
26       30        36     26
27       37        34     31
29       33        31     33

In [117]:
# temp.drop('January',axis=1)

In [118]:
# temp.drop(['January','March'],axis=1)

In [119]:
# temp[['January','March']]

In [120]:
temp.head()

   January  February  March
0       27        27     37
1       28        28     26
2       25        29     30
3       33        29     31
4       29        31     28

In [129]:
temp.rename(columns={'January':'Jan','February':'Feb','March':'Mar'},inplace=True)

In [130]:
temp.head()

   Jan  Feb  Mar
0   27   27   37
1    0    0   26
2   25   29   30
3   33   29   31
4   29   31    0

In [123]:
temp.replace(28,0,inplace=True)

In [124]:
temp.head()

   January  February  March
0       27        27     37
1        0         0     26
2       25        29     30
3       33        29     31
4       29        31      0

In [131]:
temp['Mar'][1] = 'no value'

In [141]:
temp['Mar'][1] = np.nan
temp.head()

C:\Users\USER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

   Jan  Feb  Mar
0   27   27   37
1    0    0  NaN
2   25   29   30
3   33   29   31
4   29   31    0

In [143]:
temp.head()
# temp.iloc[[0,2,4]].replace(27,20,inplace=True)

   Jan  Feb  Mar
0   27   27   37
1    0    0  NaN
2   25   29   30
3   33   29   31
4   29   31    0

In [146]:
copied = temp.copy()

In [148]:
copied.drop(1,inplace=True)

In [151]:
int(np.mean(copied['Mar']))

29

In [163]:
temp['Mar'][1] = int(np.mean(copied['Mar']))

C:\Users\USER\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [95]:
#synthax for value count

In [167]:
# temp['JanFeb'] = temp['Jan'] + temp['Feb']

In [168]:
temp.loc['Total'] = [sum(temp['Jan']),sum(temp['Feb']),sum(temp['Mar'])]

In [169]:
temp.tail()

       Jan  Feb  Mar
25      38   36   33
26      30   36   26
27      37   34   31
29      33   31   33
Total  891  876  847

In [107]:
temp['Mar'].fillna(0,inplace=True)

In [108]:
temp['Mar']
temp.head()

   Jan  Feb  Mar  JanFeb
0   27   27   37      54
1    0    0    0       0
2   25   29   30      54
3   33   29   31      62
4   29   31    0      60